app/Controllers/AmbilAntrian.php

    public function index()
    {
        $title = 'Menu Antrian';
        $model = new PelayananModel();
        $pelayanandata = $model->findAll();
---
SELECT *
FROM `pelayanan`