app/Controllers/Loket.php

    public function add(){
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nama' => 'required',
            'keterangan' => 'required',
            'pelayanan_id' => 'required',
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid){
            $loket = new LoketModel();
            $loket->insert([
            'nama' => $this->request->getPost('nama'),
            'keterangan' => $this->request->getPost('keterangan'),
            'pelayanan_id' => $this->request->getPost('pelayanan_id'),
            ]);
            return redirect()->to('/loket');
        }
            $title = "Tambah Loket";
            $model = new PelayananModel();
            $pelayanandata = $model->findAll();
---
SELECT *
FROM `pelayanan`

    public function edit($id){
        $loket= new LoketModel();
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nama' => 'required',
            'keterangan' => 'required',
            'pelayanan_id' => 'required',
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid){
            $loket = new LoketModel();
            $loket->update($id, [
            'nama' => $this->request->getPost('nama'),
            'keterangan' => $this->request->getPost('keterangan'),
            'pelayanan_id' => $this->request->getPost('pelayanan_id'),
            ]);
            return redirect()->to('/loket');
        }
        $data= $loket->where('id',$id)->first();
        $title = "Edit Loket";
        $model = new PelayananModel();
        $pelayanandata = $model->findAll();
---
SELECT *
FROM `loket`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `pelayanan`