app/Controllers/Pelayanan.php

SELECT *
FROM `pelayanan`
---
    public function index()
    {
        $title = 'Menu pelayanan';
        $model = new PelayananModel();
        $pelayanan = $model->findAll();

SELECT *
FROM `pelayanan`
WHERE `id` = '1'
 LIMIT 1
---
    public function edit($id){
        $pelayanan= new PelayananModel();
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nama' => 'required',
            'keterangan' => 'required',
            'kode' => 'required',
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid){
            $pelayanan = new PelayananModel();
            $pelayanan->update($id, [
            'nama' => $this->request->getPost('nama'),
            'keterangan' => $this->request->getPost('keterangan'),
            'kode' => $this->request->getPost('kode'),
            ]);
            return redirect()->to('/pelayanan');
        }
        $data= $pelayanan->where('id',$id)->first();