app/Controllers/TampilAntrian.php

SELECT *
FROM `pelayanan`
---
    public function index()
    {
        $title = 'Menu Antrian';
        $model = new PelayananModel();
        $pelayanandata = $model->findAll();