app/Models/LoketModel.php

    public function getLoket()
    {
        $builder = $this->db->table('loket');
        $builder->select('loket.id,loket.nama as namaloket,loket.keterangan as ketloket,loket.pelayanan_id,pelayanan.nama,pelayanan.keterangan,pelayanan.kode');
        $builder->join('pelayanan', 'pelayanan.id = loket.pelayanan_id', 'left');
        $query = $builder->get();
---
SELECT `loket`.`id`, `loket`.`nama` as `namaloket`, `loket`.`keterangan` as `ketloket`, `loket`.`pelayanan_id`, `pelayanan`.`nama`, `pelayanan`.`keterangan`, `pelayanan`.`kode`
FROM `loket`
LEFT JOIN `pelayanan` ON `pelayanan`.`id` = `loket`.`pelayanan_id`